ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/nvmctrl.h
/*
 * Component description for NVMCTRL
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_NVMCTRL_COMPONENT_H_
#define _SAMD21_NVMCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NVMCTRL                                      */
/* ************************************************************************** */

/* -------- NVMCTRL_CTRLA : (NVMCTRL Offset: 0x00) (R/W 16) Control A -------- */
#define NVMCTRL_CTRLA_RESETVALUE _UINT16_(0x00) /*  (NVMCTRL_CTRLA) Control A  Reset Value */

#define NVMCTRL_CTRLA_CMD_Pos _UINT16_(0) /* (NVMCTRL_CTRLA) Command Position */
#define NVMCTRL_CTRLA_CMD_Msk (_UINT16_(0x7F) << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Command Mask */
#define NVMCTRL_CTRLA_CMD(value)                                                                                       \
        (NVMCTRL_CTRLA_CMD_Msk &                                                                                       \
         (_UINT16_(value) << NVMCTRL_CTRLA_CMD_Pos)) /* Assigment of value for CMD in the NVMCTRL_CTRLA register */
#define NVMCTRL_CTRLA_CMD_ER_Val                                                                                       \
        _UINT16_(0x2) /* (NVMCTRL_CTRLA) Erase Row - Erases the row addressed by the ADDR register.  */
#define NVMCTRL_CTRLA_CMD_WP_Val                                                                                       \
        _UINT16_(0x4) /* (NVMCTRL_CTRLA) Write Page - Writes the contents of the page buffer to the page addressed by  \
                         the ADDR register.  */
#define NVMCTRL_CTRLA_CMD_EAR_Val                                                                                      \
        _UINT16_(0x5) /* (NVMCTRL_CTRLA) Erase Auxiliary Row - Erases the auxiliary row addressed by the ADDR          \
                         register. This command can be given only when the security bit is not set and only to the     \
                         user configuration row.  */
#define NVMCTRL_CTRLA_CMD_WAP_Val                                                                                      \
        _UINT16_(0x6) /* (NVMCTRL_CTRLA) Write Auxiliary Page - Writes the contents of the page buffer to the page     \
                         addressed by the ADDR register. This command can be given only when the security bit is not   \
                         set and only to the user configuration row.  */
#define NVMCTRL_CTRLA_CMD_SF_Val _UINT16_(0xA) /* (NVMCTRL_CTRLA) Security Flow Command  */
#define NVMCTRL_CTRLA_CMD_WL_Val _UINT16_(0xF) /* (NVMCTRL_CTRLA) Write lockbits  */
#define NVMCTRL_CTRLA_CMD_LR_Val                                                                                       \
        _UINT16_(0x40) /* (NVMCTRL_CTRLA) Lock Region - Locks the region containing the address location in the ADDR   \
                          register.  */
#define NVMCTRL_CTRLA_CMD_UR_Val                                                                                       \
        _UINT16_(0x41) /* (NVMCTRL_CTRLA) Unlock Region - Unlocks the region containing the address location in the    \
                          ADDR register.  */
#define NVMCTRL_CTRLA_CMD_SPRM_Val _UINT16_(0x42) /* (NVMCTRL_CTRLA) Sets the power reduction mode.  */
#define NVMCTRL_CTRLA_CMD_CPRM_Val _UINT16_(0x43) /* (NVMCTRL_CTRLA) Clears the power reduction mode.  */
#define NVMCTRL_CTRLA_CMD_PBC_Val _UINT16_(0x44) /* (NVMCTRL_CTRLA) Page Buffer Clear - Clears the page buffer.  */
#define NVMCTRL_CTRLA_CMD_SSB_Val                                                                                      \
        _UINT16_(0x45) /* (NVMCTRL_CTRLA) Set Security Bit - Sets the security bit by writing 0x00 to the first byte   \
                          in the lockbit row.  */
#define NVMCTRL_CTRLA_CMD_INVALL_Val _UINT16_(0x46) /* (NVMCTRL_CTRLA) Invalidates all cache lines.  */
#define NVMCTRL_CTRLA_CMD_ER                                                                                           \
        (NVMCTRL_CTRLA_CMD_ER_Val << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Erase Row - Erases the row addressed by \
                                                               the ADDR register. Position  */
#define NVMCTRL_CTRLA_CMD_WP                                                                                           \
        (NVMCTRL_CTRLA_CMD_WP_Val                                                                                      \
         << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Write Page - Writes the contents of the page buffer to the page  \
                                      addressed by the ADDR register. Position  */
#define NVMCTRL_CTRLA_CMD_EAR                                                                                          \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_EAR_Val                                                                              \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Erase Auxiliary Row - Erases the auxiliary row addressed  \
                                             by the ADDR register. This command can be given only when the security    \
                                             bit is not set and only to the user configuration row. Position  */
#define NVMCTRL_CTRLA_CMD_WAP                                                                                          \
        (NVMCTRL_CTRLA_CMD_WAP_Val                                                                                     \
         << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Write Auxiliary Page - Writes the contents of the page buffer to \
                                      the page addressed by the ADDR register. This command can be given only when the \
                                      security bit is not set and only to the user configuration row. Position  */
#define NVMCTRL_CTRLA_CMD_SF                                                                                           \
        (NVMCTRL_CTRLA_CMD_SF_Val << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Security Flow Command Position  */
#define NVMCTRL_CTRLA_CMD_WL                                                                                           \
        (NVMCTRL_CTRLA_CMD_WL_Val << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Write lockbits Position  */
#define NVMCTRL_CTRLA_CMD_LR                                                                                           \
        (NVMCTRL_CTRLA_CMD_LR_Val                                                                                      \
         << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Lock Region - Locks the region containing the address location   \
                                      in the ADDR register. Position  */
#define NVMCTRL_CTRLA_CMD_UR                                                                                           \
        (NVMCTRL_CTRLA_CMD_UR_Val                                                                                      \
         << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Unlock Region - Unlocks the region containing the address        \
                                      location in the ADDR register. Position  */
#define NVMCTRL_CTRLA_CMD_SPRM                                                                                         \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_SPRM_Val                                                                             \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Sets the power reduction mode. Position  */
#define NVMCTRL_CTRLA_CMD_CPRM                                                                                         \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_CPRM_Val                                                                             \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Clears the power reduction mode. Position  */
#define NVMCTRL_CTRLA_CMD_PBC                                                                                          \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_PBC_Val                                                                              \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Page Buffer Clear - Clears the page buffer. Position  */
#define NVMCTRL_CTRLA_CMD_SSB                                                                                          \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_SSB_Val                                                                              \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Set Security Bit - Sets the security bit by writing 0x00  \
                                             to the first byte in the lockbit row. Position  */
#define NVMCTRL_CTRLA_CMD_INVALL                                                                                       \
        (                                                                                                              \
                NVMCTRL_CTRLA_CMD_INVALL_Val                                                                           \
                << NVMCTRL_CTRLA_CMD_Pos) /* (NVMCTRL_CTRLA) Invalidates all cache lines. Position  */
#define NVMCTRL_CTRLA_CMDEX_Pos _UINT16_(8) /* (NVMCTRL_CTRLA) Command Execution Position */
#define NVMCTRL_CTRLA_CMDEX_Msk (_UINT16_(0xFF) << NVMCTRL_CTRLA_CMDEX_Pos) /* (NVMCTRL_CTRLA) Command Execution Mask  \
                                                                             */
#define NVMCTRL_CTRLA_CMDEX(value)                                                                                     \
        (NVMCTRL_CTRLA_CMDEX_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << NVMCTRL_CTRLA_CMDEX_Pos)) /* Assigment of value for CMDEX in the NVMCTRL_CTRLA register */
#define NVMCTRL_CTRLA_CMDEX_KEY_Val _UINT16_(0xA5) /* (NVMCTRL_CTRLA) Execution Key  */
#define NVMCTRL_CTRLA_CMDEX_KEY                                                                                        \
        (NVMCTRL_CTRLA_CMDEX_KEY_Val << NVMCTRL_CTRLA_CMDEX_Pos) /* (NVMCTRL_CTRLA) Execution Key Position  */
#define NVMCTRL_CTRLA_Msk _UINT16_(0xFF7F) /* (NVMCTRL_CTRLA) Register Mask  */


/* -------- NVMCTRL_CTRLB : (NVMCTRL Offset: 0x04) (R/W 32) Control B -------- */
#define NVMCTRL_CTRLB_RESETVALUE _UINT32_(0x00) /*  (NVMCTRL_CTRLB) Control B  Reset Value */

#define NVMCTRL_CTRLB_RWS_Pos _UINT32_(1) /* (NVMCTRL_CTRLB) NVM Read Wait States Position */
#define NVMCTRL_CTRLB_RWS_Msk (_UINT32_(0xF) << NVMCTRL_CTRLB_RWS_Pos) /* (NVMCTRL_CTRLB) NVM Read Wait States Mask */
#define NVMCTRL_CTRLB_RWS(value)                                                                                       \
        (NVMCTRL_CTRLB_RWS_Msk &                                                                                       \
         (_UINT32_(value) << NVMCTRL_CTRLB_RWS_Pos)) /* Assigment of value for RWS in the NVMCTRL_CTRLB register */
#define NVMCTRL_CTRLB_RWS_SINGLE_Val _UINT32_(0x0) /* (NVMCTRL_CTRLB) Single Auto Wait State  */
#define NVMCTRL_CTRLB_RWS_HALF_Val _UINT32_(0x1) /* (NVMCTRL_CTRLB) Half Auto Wait State  */
#define NVMCTRL_CTRLB_RWS_DUAL_Val _UINT32_(0x2) /* (NVMCTRL_CTRLB) Dual Auto Wait State  */
#define NVMCTRL_CTRLB_RWS_SINGLE                                                                                       \
        (NVMCTRL_CTRLB_RWS_SINGLE_Val << NVMCTRL_CTRLB_RWS_Pos) /* (NVMCTRL_CTRLB) Single Auto Wait State Position  */
#define NVMCTRL_CTRLB_RWS_HALF                                                                                         \
        (NVMCTRL_CTRLB_RWS_HALF_Val << NVMCTRL_CTRLB_RWS_Pos) /* (NVMCTRL_CTRLB) Half Auto Wait State Position  */
#define NVMCTRL_CTRLB_RWS_DUAL                                                                                         \
        (NVMCTRL_CTRLB_RWS_DUAL_Val << NVMCTRL_CTRLB_RWS_Pos) /* (NVMCTRL_CTRLB) Dual Auto Wait State Position  */
#define NVMCTRL_CTRLB_MANW_Pos _UINT32_(7) /* (NVMCTRL_CTRLB) Manual Write Position */
#define NVMCTRL_CTRLB_MANW_Msk (_UINT32_(0x1) << NVMCTRL_CTRLB_MANW_Pos) /* (NVMCTRL_CTRLB) Manual Write Mask */
#define NVMCTRL_CTRLB_MANW(value)                                                                                      \
        (NVMCTRL_CTRLB_MANW_Msk &                                                                                      \
         (_UINT32_(value) << NVMCTRL_CTRLB_MANW_Pos)) /* Assigment of value for MANW in the NVMCTRL_CTRLB register */
#define NVMCTRL_CTRLB_SLEEPPRM_Pos _UINT32_(8) /* (NVMCTRL_CTRLB) Power Reduction Mode during Sleep Position */
#define NVMCTRL_CTRLB_SLEEPPRM_Msk                                                                                     \
        (_UINT32_(0x3) << NVMCTRL_CTRLB_SLEEPPRM_Pos) /* (NVMCTRL_CTRLB) Power Reduction Mode during Sleep Mask */
#define NVMCTRL_CTRLB_SLEEPPRM(value)                                                                                  \
        (NVMCTRL_CTRLB_SLEEPPRM_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << NVMCTRL_CTRLB_SLEEPPRM_Pos)) /* Assigment of value for SLEEPPRM in the NVMCTRL_CTRLB register */
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS_Val                                                                        \
        _UINT32_(0x0) /* (NVMCTRL_CTRLB) NVM block enters low-power mode when entering sleep.NVM block exits low-power \
                         mode upon first access.  */
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT_Val                                                                       \
        _UINT32_(0x1) /* (NVMCTRL_CTRLB) NVM block enters low-power mode when entering sleep.NVM block exits low-power \
                         mode when exiting sleep.  */
#define NVMCTRL_CTRLB_SLEEPPRM_DISABLED_Val _UINT32_(0x3) /* (NVMCTRL_CTRLB) Auto power reduction disabled.  */
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS                                                                            \
        (NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS_Val                                                                       \
         << NVMCTRL_CTRLB_SLEEPPRM_Pos) /* (NVMCTRL_CTRLB) NVM block enters low-power mode when entering sleep.NVM     \
                                           block exits low-power mode upon first access. Position  */
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT                                                                           \
        (NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT_Val                                                                      \
         << NVMCTRL_CTRLB_SLEEPPRM_Pos) /* (NVMCTRL_CTRLB) NVM block enters low-power mode when entering sleep.NVM     \
                                           block exits low-power mode when exiting sleep. Position  */
#define NVMCTRL_CTRLB_SLEEPPRM_DISABLED                                                                                \
        (NVMCTRL_CTRLB_SLEEPPRM_DISABLED_Val                                                                           \
         << NVMCTRL_CTRLB_SLEEPPRM_Pos) /* (NVMCTRL_CTRLB) Auto power reduction disabled. Position  */
#define NVMCTRL_CTRLB_READMODE_Pos _UINT32_(16) /* (NVMCTRL_CTRLB) NVMCTRL Read Mode Position */
#define NVMCTRL_CTRLB_READMODE_Msk                                                                                     \
        (_UINT32_(0x3) << NVMCTRL_CTRLB_READMODE_Pos) /* (NVMCTRL_CTRLB) NVMCTRL Read Mode Mask */
#define NVMCTRL_CTRLB_READMODE(value)                                                                                  \
        (NVMCTRL_CTRLB_READMODE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << NVMCTRL_CTRLB_READMODE_Pos)) /* Assigment of value for READMODE in the NVMCTRL_CTRLB register */
#define NVMCTRL_CTRLB_READMODE_NO_MISS_PENALTY_Val                                                                     \
        _UINT32_(0x0) /* (NVMCTRL_CTRLB) The NVM Controller (cache system) does not insert wait states on a cache      \
                         miss. Gives the best system performance.  */
#define NVMCTRL_CTRLB_READMODE_LOW_POWER_Val                                                                           \
        _UINT32_(0x1) /* (NVMCTRL_CTRLB) Reduces power consumption of the cache system, but inserts a wait state each  \
                         time there is a cache miss. This mode may not be relevant if CPU performance is required, as  \
                         the application will be stalled and may lead to increase run time.  */
#define NVMCTRL_CTRLB_READMODE_DETERMINISTIC_Val                                                                       \
        _UINT32_(0x2) /* (NVMCTRL_CTRLB) The cache system ensures that a cache hit or miss takes the same amount of    \
                         time, determined by the number of programmed flash wait states. This mode can be used for     \
                         real-time applications that require deterministic execution timings.  */
#define NVMCTRL_CTRLB_READMODE_NO_MISS_PENALTY                                                                         \
        (NVMCTRL_CTRLB_READMODE_NO_MISS_PENALTY_Val                                                                    \
         << NVMCTRL_CTRLB_READMODE_Pos) /* (NVMCTRL_CTRLB) The NVM Controller (cache system) does not insert wait      \
                                           states on a cache miss. Gives the best system performance. Position  */
#define NVMCTRL_CTRLB_READMODE_LOW_POWER                                                                               \
        (NVMCTRL_CTRLB_READMODE_LOW_POWER_Val                                                                          \
         << NVMCTRL_CTRLB_READMODE_Pos) /* (NVMCTRL_CTRLB) Reduces power consumption of the cache system, but inserts  \
                                           a wait state each time there is a cache miss. This mode may not be relevant \
                                           if CPU performance is required, as the application will be stalled and may  \
                                           lead to increase run time. Position  */
#define NVMCTRL_CTRLB_READMODE_DETERMINISTIC                                                                           \
        (NVMCTRL_CTRLB_READMODE_DETERMINISTIC_Val                                                                      \
         << NVMCTRL_CTRLB_READMODE_Pos) /* (NVMCTRL_CTRLB) The cache system ensures that a cache hit or miss takes the \
                                           same amount of time, determined by the number of programmed flash wait      \
                                           states. This mode can be used for real-time applications that require       \
                                           deterministic execution timings. Position  */
#define NVMCTRL_CTRLB_CACHEDIS_Pos _UINT32_(18) /* (NVMCTRL_CTRLB) Cache Disable Position */
#define NVMCTRL_CTRLB_CACHEDIS_Msk                                                                                     \
        (_UINT32_(0x1) << NVMCTRL_CTRLB_CACHEDIS_Pos) /* (NVMCTRL_CTRLB) Cache Disable Mask */
#define NVMCTRL_CTRLB_CACHEDIS(value)                                                                                  \
        (NVMCTRL_CTRLB_CACHEDIS_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << NVMCTRL_CTRLB_CACHEDIS_Pos)) /* Assigment of value for CACHEDIS in the NVMCTRL_CTRLB register */
#define NVMCTRL_CTRLB_Msk _UINT32_(0x0007039E) /* (NVMCTRL_CTRLB) Register Mask  */


/* -------- NVMCTRL_PARAM : (NVMCTRL Offset: 0x08) (R/W 32) NVM Parameter -------- */
#define NVMCTRL_PARAM_RESETVALUE _UINT32_(0x00) /*  (NVMCTRL_PARAM) NVM Parameter  Reset Value */

