ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/nvmctrl.h
#define NVMCTRL_PARAM_NVMP_Pos _UINT32_(0) /* (NVMCTRL_PARAM) NVM Pages Position */
#define NVMCTRL_PARAM_NVMP_Msk (_UINT32_(0xFFFF) << NVMCTRL_PARAM_NVMP_Pos) /* (NVMCTRL_PARAM) NVM Pages Mask */
#define NVMCTRL_PARAM_NVMP(value)                                                                                      \
        (NVMCTRL_PARAM_NVMP_Msk &                                                                                      \
         (_UINT32_(value) << NVMCTRL_PARAM_NVMP_Pos)) /* Assigment of value for NVMP in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_PSZ_Pos _UINT32_(16) /* (NVMCTRL_PARAM) Page Size Position */
#define NVMCTRL_PARAM_PSZ_Msk (_UINT32_(0x7) << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) Page Size Mask */
#define NVMCTRL_PARAM_PSZ(value)                                                                                       \
        (NVMCTRL_PARAM_PSZ_Msk &                                                                                       \
         (_UINT32_(value) << NVMCTRL_PARAM_PSZ_Pos)) /* Assigment of value for PSZ in the NVMCTRL_PARAM register */
#define NVMCTRL_PARAM_PSZ_8_Val _UINT32_(0x0) /* (NVMCTRL_PARAM) 8 bytes  */
#define NVMCTRL_PARAM_PSZ_16_Val _UINT32_(0x1) /* (NVMCTRL_PARAM) 16 bytes  */
#define NVMCTRL_PARAM_PSZ_32_Val _UINT32_(0x2) /* (NVMCTRL_PARAM) 32 bytes  */
#define NVMCTRL_PARAM_PSZ_64_Val _UINT32_(0x3) /* (NVMCTRL_PARAM) 64 bytes  */
#define NVMCTRL_PARAM_PSZ_128_Val _UINT32_(0x4) /* (NVMCTRL_PARAM) 128 bytes  */
#define NVMCTRL_PARAM_PSZ_256_Val _UINT32_(0x5) /* (NVMCTRL_PARAM) 256 bytes  */
#define NVMCTRL_PARAM_PSZ_512_Val _UINT32_(0x6) /* (NVMCTRL_PARAM) 512 bytes  */
#define NVMCTRL_PARAM_PSZ_1024_Val _UINT32_(0x7) /* (NVMCTRL_PARAM) 1024 bytes  */
#define NVMCTRL_PARAM_PSZ_8 (NVMCTRL_PARAM_PSZ_8_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 8 bytes Position  */
#define NVMCTRL_PARAM_PSZ_16                                                                                           \
        (NVMCTRL_PARAM_PSZ_16_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 16 bytes Position  */
#define NVMCTRL_PARAM_PSZ_32                                                                                           \
        (NVMCTRL_PARAM_PSZ_32_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 32 bytes Position  */
#define NVMCTRL_PARAM_PSZ_64                                                                                           \
        (NVMCTRL_PARAM_PSZ_64_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 64 bytes Position  */
#define NVMCTRL_PARAM_PSZ_128                                                                                          \
        (NVMCTRL_PARAM_PSZ_128_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 128 bytes Position  */
#define NVMCTRL_PARAM_PSZ_256                                                                                          \
        (NVMCTRL_PARAM_PSZ_256_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 256 bytes Position  */
#define NVMCTRL_PARAM_PSZ_512                                                                                          \
        (NVMCTRL_PARAM_PSZ_512_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 512 bytes Position  */
#define NVMCTRL_PARAM_PSZ_1024                                                                                         \
        (NVMCTRL_PARAM_PSZ_1024_Val << NVMCTRL_PARAM_PSZ_Pos) /* (NVMCTRL_PARAM) 1024 bytes Position  */
#define NVMCTRL_PARAM_Msk _UINT32_(0x0007FFFF) /* (NVMCTRL_PARAM) Register Mask  */


/* -------- NVMCTRL_INTENCLR : (NVMCTRL Offset: 0x0C) (R/W 8) Interrupt Enable Clear -------- */
#define NVMCTRL_INTENCLR_RESETVALUE _UINT8_(0x00) /*  (NVMCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define NVMCTRL_INTENCLR_READY_Pos _UINT8_(0) /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENCLR_READY_Msk                                                                                     \
        (_UINT8_(0x1) << NVMCTRL_INTENCLR_READY_Pos) /* (NVMCTRL_INTENCLR) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_READY(value)                                                                                  \
        (NVMCTRL_INTENCLR_READY_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTENCLR_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_ERROR_Pos _UINT8_(1) /* (NVMCTRL_INTENCLR) Error Interrupt Enable Position */
#define NVMCTRL_INTENCLR_ERROR_Msk                                                                                     \
        (_UINT8_(0x1) << NVMCTRL_INTENCLR_ERROR_Pos) /* (NVMCTRL_INTENCLR) Error Interrupt Enable Mask */
#define NVMCTRL_INTENCLR_ERROR(value)                                                                                  \
        (NVMCTRL_INTENCLR_ERROR_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTENCLR_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTENCLR register */
#define NVMCTRL_INTENCLR_Msk _UINT8_(0x03) /* (NVMCTRL_INTENCLR) Register Mask  */


/* -------- NVMCTRL_INTENSET : (NVMCTRL Offset: 0x10) (R/W 8) Interrupt Enable Set -------- */
#define NVMCTRL_INTENSET_RESETVALUE _UINT8_(0x00) /*  (NVMCTRL_INTENSET) Interrupt Enable Set  Reset Value */

#define NVMCTRL_INTENSET_READY_Pos _UINT8_(0) /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENSET_READY_Msk                                                                                     \
        (_UINT8_(0x1) << NVMCTRL_INTENSET_READY_Pos) /* (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENSET_READY(value)                                                                                  \
        (NVMCTRL_INTENSET_READY_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTENSET_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_ERROR_Pos _UINT8_(1) /* (NVMCTRL_INTENSET) Error Interrupt Enable Position */
#define NVMCTRL_INTENSET_ERROR_Msk                                                                                     \
        (_UINT8_(0x1) << NVMCTRL_INTENSET_ERROR_Pos) /* (NVMCTRL_INTENSET) Error Interrupt Enable Mask */
#define NVMCTRL_INTENSET_ERROR(value)                                                                                  \
        (NVMCTRL_INTENSET_ERROR_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTENSET_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTENSET register */
#define NVMCTRL_INTENSET_Msk _UINT8_(0x03) /* (NVMCTRL_INTENSET) Register Mask  */


