ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/nvmctrl.h
/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 8) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE _UINT8_(0x00) /*  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_READY_Pos _UINT8_(0) /* (NVMCTRL_INTFLAG) NVM Ready Position */
#define NVMCTRL_INTFLAG_READY_Msk (_UINT8_(0x1) << NVMCTRL_INTFLAG_READY_Pos) /* (NVMCTRL_INTFLAG) NVM Ready Mask */
#define NVMCTRL_INTFLAG_READY(value)                                                                                   \
        (NVMCTRL_INTFLAG_READY_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTFLAG_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_ERROR_Pos _UINT8_(1) /* (NVMCTRL_INTFLAG) Error Position */
#define NVMCTRL_INTFLAG_ERROR_Msk (_UINT8_(0x1) << NVMCTRL_INTFLAG_ERROR_Pos) /* (NVMCTRL_INTFLAG) Error Mask */
#define NVMCTRL_INTFLAG_ERROR(value)                                                                                   \
        (NVMCTRL_INTFLAG_ERROR_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << NVMCTRL_INTFLAG_ERROR_Pos)) /* Assigment of value for ERROR in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_Msk _UINT8_(0x03) /* (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE _UINT16_(0x00) /*  (NVMCTRL_STATUS) Status  Reset Value */

#define NVMCTRL_STATUS_PRM_Pos _UINT16_(0) /* (NVMCTRL_STATUS) Power Reduction Mode Position */
#define NVMCTRL_STATUS_PRM_Msk                                                                                         \
        (_UINT16_(0x1) << NVMCTRL_STATUS_PRM_Pos) /* (NVMCTRL_STATUS) Power Reduction Mode Mask */
#define NVMCTRL_STATUS_PRM(value)                                                                                      \
        (NVMCTRL_STATUS_PRM_Msk &                                                                                      \
         (_UINT16_(value) << NVMCTRL_STATUS_PRM_Pos)) /* Assigment of value for PRM in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOAD_Pos _UINT16_(1) /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Position */
#define NVMCTRL_STATUS_LOAD_Msk                                                                                        \
        (_UINT16_(0x1) << NVMCTRL_STATUS_LOAD_Pos) /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Mask */
#define NVMCTRL_STATUS_LOAD(value)                                                                                     \
        (NVMCTRL_STATUS_LOAD_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << NVMCTRL_STATUS_LOAD_Pos)) /* Assigment of value for LOAD in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_PROGE_Pos _UINT16_(2) /* (NVMCTRL_STATUS) Programming Error Status Position */
#define NVMCTRL_STATUS_PROGE_Msk                                                                                       \
        (_UINT16_(0x1) << NVMCTRL_STATUS_PROGE_Pos) /* (NVMCTRL_STATUS) Programming Error Status Mask */
#define NVMCTRL_STATUS_PROGE(value)                                                                                    \
        (NVMCTRL_STATUS_PROGE_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << NVMCTRL_STATUS_PROGE_Pos)) /* Assigment of value for PROGE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOCKE_Pos _UINT16_(3) /* (NVMCTRL_STATUS) Lock Error Status Position */
#define NVMCTRL_STATUS_LOCKE_Msk                                                                                       \
        (_UINT16_(0x1) << NVMCTRL_STATUS_LOCKE_Pos) /* (NVMCTRL_STATUS) Lock Error Status Mask */
#define NVMCTRL_STATUS_LOCKE(value)                                                                                    \
        (NVMCTRL_STATUS_LOCKE_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << NVMCTRL_STATUS_LOCKE_Pos)) /* Assigment of value for LOCKE in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_NVME_Pos _UINT16_(4) /* (NVMCTRL_STATUS) NVM Error Position */
#define NVMCTRL_STATUS_NVME_Msk (_UINT16_(0x1) << NVMCTRL_STATUS_NVME_Pos) /* (NVMCTRL_STATUS) NVM Error Mask */
#define NVMCTRL_STATUS_NVME(value)                                                                                     \
        (NVMCTRL_STATUS_NVME_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << NVMCTRL_STATUS_NVME_Pos)) /* Assigment of value for NVME in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_SB_Pos _UINT16_(8) /* (NVMCTRL_STATUS) Security Bit Status Position */
#define NVMCTRL_STATUS_SB_Msk (_UINT16_(0x1) << NVMCTRL_STATUS_SB_Pos) /* (NVMCTRL_STATUS) Security Bit Status Mask */
#define NVMCTRL_STATUS_SB(value)                                                                                       \
        (NVMCTRL_STATUS_SB_Msk &                                                                                       \
         (_UINT16_(value) << NVMCTRL_STATUS_SB_Pos)) /* Assigment of value for SB in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_Msk _UINT16_(0x011F) /* (NVMCTRL_STATUS) Register Mask  */


