ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/nvmctrl.h
/* -------- NVMCTRL_ADDR : (NVMCTRL Offset: 0x1C) (R/W 32) Address -------- */
#define NVMCTRL_ADDR_RESETVALUE _UINT32_(0x00) /*  (NVMCTRL_ADDR) Address  Reset Value */

#define NVMCTRL_ADDR_ADDR_Pos _UINT32_(0) /* (NVMCTRL_ADDR) NVM Address Position */
#define NVMCTRL_ADDR_ADDR_Msk (_UINT32_(0x3FFFFF) << NVMCTRL_ADDR_ADDR_Pos) /* (NVMCTRL_ADDR) NVM Address Mask */
#define NVMCTRL_ADDR_ADDR(value)                                                                                       \
        (NVMCTRL_ADDR_ADDR_Msk &                                                                                       \
         (_UINT32_(value) << NVMCTRL_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the NVMCTRL_ADDR register */
#define NVMCTRL_ADDR_Msk _UINT32_(0x003FFFFF) /* (NVMCTRL_ADDR) Register Mask  */


/* -------- NVMCTRL_LOCK : (NVMCTRL Offset: 0x20) (R/W 16) Lock Section -------- */
#define NVMCTRL_LOCK_LOCK_Pos _UINT16_(0) /* (NVMCTRL_LOCK) Region Lock Bits Position */
#define NVMCTRL_LOCK_LOCK_Msk (_UINT16_(0xFFFF) << NVMCTRL_LOCK_LOCK_Pos) /* (NVMCTRL_LOCK) Region Lock Bits Mask */
#define NVMCTRL_LOCK_LOCK(value)                                                                                       \
        (NVMCTRL_LOCK_LOCK_Msk &                                                                                       \
         (_UINT16_(value) << NVMCTRL_LOCK_LOCK_Pos)) /* Assigment of value for LOCK in the NVMCTRL_LOCK register */
#define NVMCTRL_LOCK_Msk _UINT16_(0xFFFF) /* (NVMCTRL_LOCK) Register Mask  */


/** \brief NVMCTRL register offsets definitions */
#define NVMCTRL_CTRLA_REG_OFST _UINT32_(0x00) /* (NVMCTRL_CTRLA) Control A Offset */
#define NVMCTRL_CTRLB_REG_OFST _UINT32_(0x04) /* (NVMCTRL_CTRLB) Control B Offset */
#define NVMCTRL_PARAM_REG_OFST _UINT32_(0x08) /* (NVMCTRL_PARAM) NVM Parameter Offset */
#define NVMCTRL_INTENCLR_REG_OFST _UINT32_(0x0C) /* (NVMCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define NVMCTRL_INTENSET_REG_OFST _UINT32_(0x10) /* (NVMCTRL_INTENSET) Interrupt Enable Set Offset */
#define NVMCTRL_INTFLAG_REG_OFST _UINT32_(0x14) /* (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define NVMCTRL_STATUS_REG_OFST _UINT32_(0x18) /* (NVMCTRL_STATUS) Status Offset */
#define NVMCTRL_ADDR_REG_OFST _UINT32_(0x1C) /* (NVMCTRL_ADDR) Address Offset */
#define NVMCTRL_LOCK_REG_OFST _UINT32_(0x20) /* (NVMCTRL_LOCK) Lock Section Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief NVMCTRL register API structure */
typedef struct { /* Non-Volatile Memory Controller */
        __IO uint16_t NVMCTRL_CTRLA; /**< Offset: 0x00 (R/W  16) Control A */
        __I uint8_t Reserved1[0x02];
        __IO uint32_t NVMCTRL_CTRLB; /**< Offset: 0x04 (R/W  32) Control B */
        __IO uint32_t NVMCTRL_PARAM; /**< Offset: 0x08 (R/W  32) NVM Parameter */
        __IO uint8_t NVMCTRL_INTENCLR; /**< Offset: 0x0C (R/W  8) Interrupt Enable Clear */
        __I uint8_t Reserved2[0x03];
        __IO uint8_t NVMCTRL_INTENSET; /**< Offset: 0x10 (R/W  8) Interrupt Enable Set */
        __I uint8_t Reserved3[0x03];
        __IO uint8_t NVMCTRL_INTFLAG; /**< Offset: 0x14 (R/W  8) Interrupt Flag Status and Clear */
        __I uint8_t Reserved4[0x03];
        __IO uint16_t NVMCTRL_STATUS; /**< Offset: 0x18 (R/W  16) Status */
        __I uint8_t Reserved5[0x02];
        __IO uint32_t NVMCTRL_ADDR; /**< Offset: 0x1C (R/W  32) Address */
        __IO uint16_t NVMCTRL_LOCK; /**< Offset: 0x20 (R/W  16) Lock Section */
} nvmctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_NVMCTRL_COMPONENT_H_ */
